//
//  Hangul.swift
//  Saessakhyeyo
//
//  Created by 윤겸지 on 2023/07/05.
//

import Foundation

struct Hangul {
    let CHO = [
        "ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"
    ]
    let JUNG = [
        "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ","ㅕ", "ㅖ", "ㅗ", "ㅘ",
        "ㅙ", "ㅚ","ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ",
        "ㅣ"
    ]
    let JONG = [
        "","ㄱ","ㄲ","ㄳ","ㄴ","ㄵ","ㄶ","ㄷ","ㄹ","ㄺ",
        "ㄻ","ㄼ","ㄽ","ㄾ","ㄿ","ㅀ","ㅁ","ㅂ","ㅄ","ㅅ",
        "ㅆ","ㅇ","ㅈ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"
    ]
    let JONG_DOUBLE = [
        "ㄳ":"ㄳ","ㄵ":"ㄵ","ㄶ":"ㄶ","ㄺ":"ㄺ","ㄻ":"ㄻ",
        "ㄼ":"ㄼ","ㄽ":"ㄽ","ㄾ":"ㄾ","ㄿ":"ㄿ","ㅀ":"ㅀ",
        "ㅄ":"ㅄ"
    ]
    
    let JONG_DOUBLE_ARR = ["ㄳ", "ㄵ", "ㄶ", "ㄺ", "ㄻ", "ㄼ" ,"ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅄ"]
}

extension String {
    subscript(index: Int) -> Character {
        return self[self.index(self.startIndex, offsetBy: index)]
    }
}
